### 시리즈 vs 시리즈

> 시리즈와 시리즈 연산: Series1 + 연산자(+, -, *, /) + Series2

두 시리즈 간의 사칙연산을 먼저 처리한다. 그리고 연산의 결과로 반환된 4개의 시리즈 객체(addtion, subtraction, multiplication, division)를 DataFrame() 메소드를 이용하여 
하나의 데이터프레임으로 합치는 과정을 보여준다.

In [2]:
import pandas as pd

student1 = pd.Series({'국어':100, '영어':80, '수학':90})
student2 = pd.Series({'국어':100, '영어':80, '수학':90})

In [3]:
student1

국어    100
영어     80
수학     90
dtype: int64

In [4]:
student2

국어    100
영어     80
수학     90
dtype: int64

In [10]:
addition = student1 + student2
subtraction = student1 - student2
multiplication = student1 * student2
division = student1/student2

In [11]:
result = pd.DataFrame([addition, subtraction, multiplication, division],
                     index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

          국어      영어      수학
덧셈     200.0   160.0   180.0
뺄셈       0.0     0.0     0.0
곱셈   10000.0  6400.0  8100.0
나눗셈      1.0     1.0     1.0

In [12]:
# NaN 값이 있는 시리즈 연산 (1.23_series_to_series2)
import pandas as pd
import numpy as np

In [13]:
# 딕셔너리 데이터 판다스 시리즈 만들기 
student1 = pd.Series({'국어': np.nan, '영어':80, '수학':90})
student2 = pd.Series({'국어': 80, '수학':90})

student1

국어     NaN
영어    80.0
수학    90.0
dtype: float64

In [15]:
student2

국어    80
수학    90
dtype: int64

In [16]:
addition = student1 + student2
substraction = student1 - student2
multiplication = student1 * student2
division = student1 / student2

In [17]:
result = pd.DataFrame([addition, substraction, multiplication, division],
                     index=['덧셈','뺄셈','곱셈','나눗셈'])
result

     국어      수학  영어
덧셈  NaN   180.0 NaN
뺄셈  NaN     0.0 NaN
곱셈  NaN  8100.0 NaN
나눗셈 NaN     1.0 NaN

### 연산 메소드 
객체 사이에 공통 인덱스가 없거나 NaN이 포함된 경우 연산 결과는 NaN으로 반환된다. 이런 상황을 피하려면 연산 메소드에 fill_value 옵션을 설정하여 적용한다. 다음의 예제에서는 누락 데이터 NaN 대신 숫자 0을 입력하는 예를 설명한다. 

> 연산 메소드 사용(시리즈와 시리즈 덧셈): Series1.add(Series2, fill_value=0)

In [18]:
import pandas as pd
import numpy as np

In [19]:
student1 = pd.Series({'국어': np.nan, '영어':80, '수학':90})
student2 = pd.Series({'국어': 80, '수학':90})

In [20]:
sr_add = student1.add(student2, fill_value=0) # 덧셈
sr_sub = student1.sub(student2, fill_value=0) # 뺄셈
sr_mul = student1.mul(student2, fill_value=0) # 곱셈
sr_div = student1.div(student2, fill_value=0) # 나눗셈

In [22]:
# 사칙연산 결과를 데이터프레임으로 합치기(시리즈 -> 데이터프레임)
result = pd.DataFrame([sr_add, sr_sub, sr_mul, sr_div], 
                    index=['덧셈', '뺄셈', '곱셈', '나눗셈'])
result

       국어      수학    영어
덧셈   80.0   180.0  80.0
뺄셈  -80.0     0.0  80.0
곱셈    0.0  8100.0   0.0
나눗셈   0.0     1.0   inf

## 데이터 프레임 연산
데이터프레임은 여러 시리즈가 한데 모인 것이므로 시리즈 연산을 확장하는 개념으로 이해하는 것이 좋다. 먼저 행/열 인덱스를 기준으로 정렬하고 
일대일 대응되는 원소끼리 연산을 처리한다.

### 데이터프레임 vs 숫자 
데이터프레임에 어떤 숫자를 더하면 모든 원소에 숫자를 더한다. 덧셈, 뺄셈, 곱셈, 나눗셈 모두 가능하다. 
기존 데이터프레임의 형태를 그대로 유지한 채 원소 값만 새로운 계산값으로 바뀐다. 
새로운 데이터프레임 객체로 반환되는 점에 유의합니다. 

> 데이터프레임과 숫자 연산:   DataFrame객체 + 연산자(+, -, *, /) + 숫자

다음의 예제는 데이터프레임에 10을 더하는 과정을 설명한다. 여기서는 Seaborn 라이브러리에 제공하는 데이터셋 중에서 타이타닉('titanic')데이터셋을 사용한다. 타이타닉호 탑승자에 대한 인적사항과 구조 여부 등을 정리한 자료이다. locad_dataset()함수로 불러온다.

In [25]:
!pip install seaborn

Collecting seaborn
  Using cached seaborn-0.11.0-py3-none-any.whl (283 kB)
Collecting scipy>=1.0
  Using cached scipy-1.5.2-cp38-cp38-win_amd64.whl (31.4 MB)
Requirement already satisfied: numpy>=1.15 in c:\users\이혜성\desktop\data_anal\env\lib\site-packages (from seaborn) (1.19.2)
Requirement already satisfied: pandas>=0.23 in c:\users\이혜성\desktop\data_anal\env\lib\site-packages (from seaborn) (1.1.2)
Requirement already satisfied: matplotlib>=2.2 in c:\users\이혜성\desktop\data_anal\env\lib\site-packages (from seaborn) (3.3.2)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\이혜성\desktop\data_anal\env\lib\site-packages (from pandas>=0.23->seaborn) (2.8.1)
Requirement already satisfied: pytz>=2017.2 in c:\users\이혜성\desktop\data_anal\env\lib\site-packages (from pandas>=0.23->seaborn) (2020.1)
Requirement already satisfied: pyparsing!=2.0.4,!=2.1.2,!=2.1.6,>=2.0.3 in c:\users\이혜성\desktop\data_anal\env\lib\site-packages (from matplotlib>=2.2->seaborn) (2.4.7)
Requirement already satisfied: cycler>=0.10 in c:\users\이혜성\desktop\data_anal\env\lib\site-packages (from matplotlib>=2.2->seaborn) (0.10.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\이혜성\desktop\data_anal\env\lib\site-packages (from matplotlib>=2.2->seaborn) (1.2.0)
Requirement already satisfied: pillow>=6.2.0 in c:\users\이혜성\desktop\data_anal\env\lib\site-packages (from matplotlib>=2.2->seaborn) (7.2.0)
Requirement already satisfied: certifi>=2020.06.20 in c:\users\이혜성\desktop\data_anal\env\lib\site-packages (from matplotlib>=2.2->seaborn) (2020.6.20)
Requirement already satisfied: six>=1.5 in c:\users\이혜성\desktop\data_anal\env\lib\site-packages (from python-dateutil>=2.7.3->pandas>=0.23->seaborn) (1.15.0)
Installing collected packages: scipy, seaborn
Successfully installed scipy-1.5.2 seaborn-0.11.0

In [26]:
# 데이터프레임에 숫자 더하기 Part1 1.25_df_to_number
import pandas as pd
import seaborn as sns

# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기 
titanic = sns.load_dataset('titanic')

In [29]:
titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [30]:
titanic.index

RangeIndex(start=0, stop=891, step=1)

In [32]:
df = titanic.loc[:, ['age','fare']]
df.head()

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [34]:
# 데이터프레임에 숫자 10 더하기
addition = df + 10
addition.head()

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

### 데이터프레임 vs 데이터프레임

각 데이터프레임의 같은 행, 같은 열 위치에 있는 원소끼리 계산한다. 이처럼 동일한 위치의 원소끼리 계산한 결과값을 원래 위치에 다시 입력하여 데이터프레임을 만든다. 데이터프레임 중에서 어느 한쪽에 원소가 존재하지 않거나 NaN이면 연산 결과는 NaN으로 처리된다. 

> 데이터프레임의 연산자 활용:  DataFrame1 + 연산자(+, -, *, /) + DataFrame2

In [35]:
# 데이터 프레임끼리 더하기 1.26_df_to_df
subtraction = addition - df
subtraction.tail()

      age  fare
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0